Revit 2015 API
AnnotationSymbolTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual AnnotationSymbolTypeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As AnnotationSymbolTypeSetIterator
Visual C++
public:
virtual AnnotationSymbolTypeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
AnnotationSymbolTypeSet Class
Autodesk.Revit.DB Namespace